---
type: IExtElemChangeBeamSection
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 1
tags: [revit-api, class]
---

# IExtElemChangeBeamSection

`Autodesk.Revit.DB.Structure.IExtElemChangeBeamSection` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | ChangeSection | 2018 | `bool ChangeSection ( Document doc , ElementId idElem )` |